export const state = () => ({
  homepage: [
    {
      block: 'cover',
      hashtag: '#РАКЛЕЧИТСЯ',
    },
    {
      block: 'note-1',
      title: 'И В ОТЛИЧИЕ ОТ РАКА,',
      hashtag: '#ЭТОНЕЛЕЧИТСЯ',
    },
    {
      block: 'note-2',
      title: 'РАССКАЗЫВАЙТЕ ВАШИ ИСТОРИИ В ИНСТАГРАМ',
      hashtag: '#ЭТОНЕЛЕЧИТСЯ',
    },
    {
      block: 'cover',
      hashtag: '#РАКЛЕЧИТСЯ',
    },
    {
      block: 'videos',
      title: 'Истории людей, победивших рак, но не свои привычки',
      note: 'Все видео вы можете найти на нашем YouTube канале.',
      text:
        'Есть вещи, которые не лечатся. Вещи ставшие частью нашего «я», фобии, страхи. Но это точно не рак. Рак лечится. Лучшее доказательство — люди с их историями.',
    },
    {
      block: 'stories',
      title: 'Истории неизлечимых привычек',
    },
    {
      block: 'instagram',
      title: 'Инстаграм',
      text:
        'Два раза в неделю мы просматриваем все посты по хештегу #этонелечится. Все истории, где нет нецензурных выражений и запрещенного контента попадают сюда. Следите за правильным написанием хештега, чтобы мы не пропустили вашу историю.',
    },
    {
      block: 'story',
      title: 'Расскажите свою историю',
      text:
        'Мы публикуем новые истории на сайте раз в неделю. Есть 2 варианта поделиться своей историей неизлечимых привычек, навязчивых идей и болезненных привязанностей.',
      extraTexts: [
        {
          title: '1-й вариант',
          id: 1,
          text:
            'Заполнить подробную форму прямо на сайте и мы опубликуем вашу историю после проверки. Пожалуйста, заполняйте все пункты корректно, если вы испытаете какие-то сложности, воспользуйтесь 2-м вариантом.',
        },
        {
          title: '2-й вариант',
          id: 2,
          text:
            'Оставить контакт (почту или номер телефона) и мы свяжемся с вами, зададим вопросы, уточним детали вашей истории.',
        },
      ],
    },
    {
      block: 'statistics',
      title: 'Статистика по онкозаболеваниям',
    },
    {
      block: 'about',
      hashtag: '#РАКЛЕЧИТСЯ',
      title: 'О проекте',
      text:
        'Этот проект был создан благотворительным фондом Константина Хабенского.',
      extraTexts: [
        {
          title: 'Рак Лечится',
          id: 1,
          text: `Есть вещи, которые не лечатся. Особенности характера, страстные увлечения, привычки, ставшие частью нашего «я», фобии, которые мы приобрели в детстве. Список можно продолжать до бесконечности, но одна болезнь в него точно не войдет. Эта болезнь — рак. Рак лечится, и лучшее доказательство — люди с их неизлечимыми особенностями, которые сумели победить рак.<br>
            Рак лечится— проект Благотворительного Фонда Константина Хабенского и Leo Burnett Moscow.С его помощью мы надеемся изменить отношение людей к раку и заставить каждого поверить: онкологическое заболевание— это не приговор.
            `,
        },
        {
          title: 'Фонд Хабенского',
          id: 2,
          text:
            'Благотворительный Фонд Константина Хабенского с 2008 года помогает детям с онкологическими и другими тяжелыми заболеваниями головного мозга. Фонд не только поддерживает семью заболевшего ребенка в самый сложный момент, оплачивая обследования, лечение и медицинские препараты, но и в целом меняет систему оказания помощи детям с опухолями мозга в России.',
        },
      ],
    },
    {
      block: 'footer',
      text: 'Рак Лечится',
      title: 'Спасибо всем, кто помог состояться этому проекту',
    },
    {
      block: 'header',
      title: 'Проект Благотворительного Фонда Константина Хабенского',
    },
  ],
});
