export const state = () => ({
  bigLists: [
    {
      id: 1,
      title: 'Общие положения.',
      text:
        'Настоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ «О персональных данных» и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных Благотворительный Фонд Константина Хабенского (далее – Оператор).',
      lists: [
        {
          id: 1,
          text:
            'Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.',
        },
        {
          id: 2,
          text:
            'Настоящая политика Оператора в отношении обработки персональных данных (далее – Политика) применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта http://raklechitsa.ru.',
        },
      ],
    },
    {
      id: 2,
      title: 'Основные понятия, используемые в Политике',
      text: '',
      lists: [
        {
          id: 1,
          text:
            'Автоматизированная обработка персональных данных – обработка персональных данных с помощью средств вычислительной техники;',
        },
        {
          id: 2,
          text:
            'Блокирование персональных данных – временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных);',
        },
        {
          id: 3,
          text:
            'Веб-сайт – совокупность графических и информационных материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу http://raklechitsa.ru;',
        },
        {
          id: 4,
          text:
            'Информационная система персональных данных — совокупность содержащихся в базах данных персональных данных, и обеспечивающих их обработку информационных технологий и технических средств;',
        },

        {
          id: 5,
          text:
            'Обезличивание персональных данных — действия, в результате которых невозможно определить без использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному субъекту персональных данных;',
        },

        {
          id: 6,
          text:
            'Обработка персональных данных – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных;',
        },

        {
          id: 7,
          text:
            'Оператор – государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и (или) осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными;',
        },

        {
          id: 8,
          text:
            'Персональные данные – любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю веб-сайта http://raklechitsa.ru;',
        },

        {
          id: 9,
          text:
            'Пользователь – любой посетитель веб-сайта http://raklechitsa.ru;',
        },

        {
          id: 10,
          text:
            'Предоставление персональных данных – действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц;',
        },

        {
          id: 11,
          text:
            'Распространение персональных данных – любые действия, направленные на раскрытие персональных данных неопределенному кругу лиц (передача персональных данных) или на ознакомление с персональными данными неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой информации, размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным данным каким-либо иным способом;',
        },

        {
          id: 12,
          text:
            'Трансграничная передача персональных данных – передача персональных данных на территорию иностранного государства органу власти иностранного государства, иностранному физическому или иностранному юридическому лицу;',
        },

        {
          id: 13,
          text:
            'Уничтожение персональных данных – любые действия, в результате которых персональные данные уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в информационной системе персональных данных и (или) результате которых уничтожаются материальные носители персональных данных.',
        },
      ],
    },
    {
      id: 3,
      title:
        'Оператор может обрабатывать следующие персональные данные Пользователя',
      text: '',
      lists: [
        {
          id: 1,
          text: 'Фамилия, имя, отчество;',
        },
        {
          id: 2,
          text: 'Электронный адрес;',
        },
        {
          id: 3,
          text: 'Номера телефонов;',
        },
        {
          id: 4,
          text: 'Год, месяц, дата и место рождения;',
        },
        {
          id: 5,
          text: 'Фотографии;',
        },
        {
          id: 6,
          text:
            'Также на сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч. файлов «cookie») с помощью сервисов интернет-статистики (Яндекс Метрика и Гугл Аналитика и других).',
        },
        {
          id: 7,
          text:
            'Вышеперечисленные данные далее по тексту Политики объединены общим понятием Персональные данные.',
        },
      ],
    },
    {
      id: 4,
      title: 'Цели обработки персональных данных',
      text: '',
      lists: [
        {
          id: 1,
          text:
            'Цель обработки персональных данных Пользователя — использование персональных данных Пользователя для публикаций на сайте.',
        },
        {
          id: 2,
          text:
            'Также Оператор имеет право направлять Пользователю уведомления о новых продуктах и услугах, специальных предложениях и различных событиях. Пользователь всегда может отказаться от получения информационных сообщений, направив Оператору письмо на адрес электронной почты raklechitsa@bfkh.ru с пометкой «Отказ от уведомлениях о новых продуктах и услугах и специальных предложениях».',
        },
        {
          id: 3,
          text:
            'Обезличенные данные Пользователей, собираемые с помощью сервисов интернет-статистики, служат для сбора информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания.',
        },
      ],
    },
    {
      id: 5,
      title: 'Правовые основания обработки персональных данных',
      text: '',
      lists: [
        {
          id: 1,
          text:
            'Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки Пользователем самостоятельно через специальные формы, расположенные на сайте http://raklechitsa.ru. Заполняя соответствующие формы и/или отправляя свои персональные данные Оператору, Пользователь выражает свое согласие с данной Политикой.',
        },
        {
          id: 2,
          text:
            'Оператор обрабатывает обезличенные данные о Пользователе в случае, если это разрешено в настройках браузера Пользователя (включено сохранение файлов «cookie» и использование технологии JavaScript).',
        },
      ],
    },
    {
      id: 6,
      title:
        'Порядок сбора, хранения, передачи и других видов обработки персональных данных',
      text:
        'Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований действующего законодательства в области защиты персональных данных.',
      lists: [
        {
          id: 1,
          text:
            'Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие доступ к персональным данным неуполномоченных лиц.',
        },
        {
          id: 2,
          text:
            'Персональные данные Пользователя никогда, ни при каких условиях не будут переданы третьим лицам, за исключением случаев, связанных с исполнением действующего законодательства.',
        },
        {
          id: 3,
          text:
            'В случае выявления неточностей в персональных данных, Пользователь может актуализировать их самостоятельно, путем направления Оператору уведомление на адрес электронной почты Оператора raklechitsa@bfkh.ru с пометкой «Актуализация персональных данных».',
        },
        {
          id: 4,
          text:
            'Срок обработки персональных данных является неограниченным. Пользователь может в любой момент отозвать свое согласие на обработку персональных данных, направив Оператору уведомление посредством электронной почты на электронный адрес Оператора raklechitsa@bfkh.ru с пометкой «Отзыв согласия на обработку персональных данных».',
        },
      ],
    },
    {
      id: 7,
      title: 'Трансграничная передача персональных данных',
      text: '',
      lists: [
        {
          id: 1,
          text:
            'Оператор до начала осуществления трансграничной передачи персональных данных обязан убедиться в том, что иностранным государством, на территорию которого предполагается осуществлять передачу персональных данных, обеспечивается надежная защита прав субъектов персональных данных.',
        },
        {
          id: 1,
          text:
            'Трансграничная передача персональных данных на территории иностранных государств, не отвечающих вышеуказанным требованиям, может осуществляться только в случае наличия согласия в письменной форме субъекта персональных данных на трансграничную передачу его персональных данных и/или исполнения договора, стороной которого является субъект персональных данных.',
        },
      ],
    },
    {
      id: 8,
      title: 'Заключительные положения',
      text: '',
      lists: [
        {
          id: 1,
          text:
            'Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных, обратившись к Оператору с помощью электронной почты raklechitsa@bfkh.ru.',
        },
        {
          id: 2,
          text:
            'В данном документе будут отражены любые изменения политики обработки персональных данных Оператором. Политика действует бессрочно до замены ее новой версией.',
        },
        {
          id: 3,
          text:
            'Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу http://raklechitsa.ru/policy.',
        },
      ],
    },
  ],
});

export const mutations = {};

export const getters = {
  getPolicy(state) {
    return state.bigLists;
  },
};
